{"class_name": "Functional", "config": {"name": "model_164", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_", "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_", "inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_1", "inbound_nodes": [[["Act1_", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_1", "inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_0_0_1", "inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_2", "inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_2", "inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_155", "trainable": true, "dtype": "float32"}, "name": "add_155", "inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_155", "inbound_nodes": [[["add_155", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_1", "inbound_nodes": [[["activation_155", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_1", "inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_1_0_1", "inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_2", "inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_2", "inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_156", "trainable": true, "dtype": "float32"}, "name": "add_156", "inbound_nodes": [[["activation_155", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_156", "inbound_nodes": [[["add_156", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_2_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_2_0_1", "inbound_nodes": [[["activation_156", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_2_0_1", "inbound_nodes": [[["Conv2D_0_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_2_0_1", "inbound_nodes": [[["BatchNorm1_0_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_2_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_2_0_2", "inbound_nodes": [[["Act1_0_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_2_0_2", "inbound_nodes": [[["Conv2D_0_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_157", "trainable": true, "dtype": "float32"}, "name": "add_157", "inbound_nodes": [[["activation_156", 0, 0, {}], ["BatchNorm1_0_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_157", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_157", "inbound_nodes": [[["add_157", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_3_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_3_0_1", "inbound_nodes": [[["activation_157", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_3_0_1", "inbound_nodes": [[["Conv2D_0_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_3_0_1", "inbound_nodes": [[["BatchNorm1_0_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_3_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_3_0_2", "inbound_nodes": [[["Act1_0_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_3_0_2", "inbound_nodes": [[["Conv2D_0_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_158", "trainable": true, "dtype": "float32"}, "name": "add_158", "inbound_nodes": [[["activation_157", 0, 0, {}], ["BatchNorm1_0_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_158", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_158", "inbound_nodes": [[["add_158", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_1", "inbound_nodes": [[["activation_158", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_1", "inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_0_0_1", "inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_2", "inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_3", "inbound_nodes": [[["activation_158", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_2", "inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_159", "trainable": true, "dtype": "float32"}, "name": "add_159", "inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_159", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_159", "inbound_nodes": [[["add_159", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_1", "inbound_nodes": [[["activation_159", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_1", "inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_1_0_1", "inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_2", "inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_2", "inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_160", "trainable": true, "dtype": "float32"}, "name": "add_160", "inbound_nodes": [[["activation_159", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_160", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_160", "inbound_nodes": [[["add_160", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_1", "inbound_nodes": [[["activation_160", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_1", "inbound_nodes": [[["Conv2D_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_0_0_1", "inbound_nodes": [[["BatchNorm1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_2", "inbound_nodes": [[["Act1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_3", "inbound_nodes": [[["activation_160", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_2", "inbound_nodes": [[["Conv2D_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_161", "trainable": true, "dtype": "float32"}, "name": "add_161", "inbound_nodes": [[["Conv2D_2_0_0_3", 0, 0, {}], ["BatchNorm1_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_161", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_161", "inbound_nodes": [[["add_161", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_1", "inbound_nodes": [[["activation_161", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_1", "inbound_nodes": [[["Conv2D_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_1_0_1", "inbound_nodes": [[["BatchNorm1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_2", "inbound_nodes": [[["Act1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_2", "inbound_nodes": [[["Conv2D_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_162", "trainable": true, "dtype": "float32"}, "name": "add_162", "inbound_nodes": [[["activation_161", 0, 0, {}], ["BatchNorm1_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_162", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_162", "inbound_nodes": [[["add_162", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_1", "inbound_nodes": [[["activation_162", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_1", "inbound_nodes": [[["Conv2D_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_2_0_1", "inbound_nodes": [[["BatchNorm1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_2", "inbound_nodes": [[["Act1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_2", "inbound_nodes": [[["Conv2D_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_163", "trainable": true, "dtype": "float32"}, "name": "add_163", "inbound_nodes": [[["activation_162", 0, 0, {}], ["BatchNorm1_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_163", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_163", "inbound_nodes": [[["add_163", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_3_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_3_0_1", "inbound_nodes": [[["activation_163", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_3_0_1", "inbound_nodes": [[["Conv2D_2_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_3_0_1", "inbound_nodes": [[["BatchNorm1_2_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_3_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_3_0_2", "inbound_nodes": [[["Act1_2_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_3_0_2", "inbound_nodes": [[["Conv2D_2_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_164", "trainable": true, "dtype": "float32"}, "name": "add_164", "inbound_nodes": [[["activation_163", 0, 0, {}], ["BatchNorm1_2_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_164", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_164", "inbound_nodes": [[["add_164", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_10", "inbound_nodes": [[["activation_164", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_10", "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_10", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}