{"class_name": "Functional", "config": {"name": "model_50", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_", "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_", "inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_1", "inbound_nodes": [[["Act1_", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_1", "inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_0_0_1", "inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_2", "inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_2", "inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_26", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_1", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_1", "inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_1_0_1", "inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_2", "inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_2", "inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["activation_26", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_27", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_2_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_2_0_1", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_2_0_1", "inbound_nodes": [[["Conv2D_0_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_2_0_1", "inbound_nodes": [[["BatchNorm1_0_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_2_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_2_0_2", "inbound_nodes": [[["Act1_0_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_2_0_2", "inbound_nodes": [[["Conv2D_0_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "name": "add_28", "inbound_nodes": [[["activation_27", 0, 0, {}], ["BatchNorm1_0_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_28", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_3_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_3_0_1", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_3_0_1", "inbound_nodes": [[["Conv2D_0_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_3_0_1", "inbound_nodes": [[["BatchNorm1_0_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_3_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_3_0_2", "inbound_nodes": [[["Act1_0_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_3_0_2", "inbound_nodes": [[["Conv2D_0_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "name": "add_29", "inbound_nodes": [[["activation_28", 0, 0, {}], ["BatchNorm1_0_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_29", "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_4_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_4_0_1", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_4_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_4_0_1", "inbound_nodes": [[["Conv2D_0_4_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_4_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_4_0_1", "inbound_nodes": [[["BatchNorm1_0_4_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_4_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_4_0_2", "inbound_nodes": [[["Act1_0_4_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_4_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_4_0_2", "inbound_nodes": [[["Conv2D_0_4_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["activation_29", 0, 0, {}], ["BatchNorm1_0_4_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_30", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_5_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_5_0_1", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_5_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_5_0_1", "inbound_nodes": [[["Conv2D_0_5_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_5_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_5_0_1", "inbound_nodes": [[["BatchNorm1_0_5_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_5_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_5_0_2", "inbound_nodes": [[["Act1_0_5_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_5_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_5_0_2", "inbound_nodes": [[["Conv2D_0_5_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_31", "trainable": true, "dtype": "float32"}, "name": "add_31", "inbound_nodes": [[["activation_30", 0, 0, {}], ["BatchNorm1_0_5_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_31", "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_6_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_6_0_1", "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_6_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_6_0_1", "inbound_nodes": [[["Conv2D_0_6_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_6_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_6_0_1", "inbound_nodes": [[["BatchNorm1_0_6_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_6_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_6_0_2", "inbound_nodes": [[["Act1_0_6_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_6_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_6_0_2", "inbound_nodes": [[["Conv2D_0_6_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_32", "trainable": true, "dtype": "float32"}, "name": "add_32", "inbound_nodes": [[["activation_31", 0, 0, {}], ["BatchNorm1_0_6_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_32", "inbound_nodes": [[["add_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_7_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_7_0_1", "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_7_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_7_0_1", "inbound_nodes": [[["Conv2D_0_7_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_7_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_7_0_1", "inbound_nodes": [[["BatchNorm1_0_7_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_7_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_7_0_2", "inbound_nodes": [[["Act1_0_7_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_7_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_7_0_2", "inbound_nodes": [[["Conv2D_0_7_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["activation_32", 0, 0, {}], ["BatchNorm1_0_7_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_33", "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_8_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_8_0_1", "inbound_nodes": [[["activation_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_8_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_8_0_1", "inbound_nodes": [[["Conv2D_0_8_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_8_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_8_0_1", "inbound_nodes": [[["BatchNorm1_0_8_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_8_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_8_0_2", "inbound_nodes": [[["Act1_0_8_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_8_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_8_0_2", "inbound_nodes": [[["Conv2D_0_8_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_34", "trainable": true, "dtype": "float32"}, "name": "add_34", "inbound_nodes": [[["activation_33", 0, 0, {}], ["BatchNorm1_0_8_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_34", "inbound_nodes": [[["add_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_1", "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_1", "inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_0_0_1", "inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_2", "inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_3", "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_2", "inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_35", "trainable": true, "dtype": "float32"}, "name": "add_35", "inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_35", "inbound_nodes": [[["add_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_1", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_1", "inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_1_0_1", "inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_2", "inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_2", "inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "name": "add_36", "inbound_nodes": [[["activation_35", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["add_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_2_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_2_0_1", "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_2_0_1", "inbound_nodes": [[["Conv2D_1_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_2_0_1", "inbound_nodes": [[["BatchNorm1_1_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_2_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_2_0_2", "inbound_nodes": [[["Act1_1_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_2_0_2", "inbound_nodes": [[["Conv2D_1_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_37", "trainable": true, "dtype": "float32"}, "name": "add_37", "inbound_nodes": [[["activation_36", 0, 0, {}], ["BatchNorm1_1_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_37", "inbound_nodes": [[["add_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_3_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_3_0_1", "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_3_0_1", "inbound_nodes": [[["Conv2D_1_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_3_0_1", "inbound_nodes": [[["BatchNorm1_1_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_3_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_3_0_2", "inbound_nodes": [[["Act1_1_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_3_0_2", "inbound_nodes": [[["Conv2D_1_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_38", "trainable": true, "dtype": "float32"}, "name": "add_38", "inbound_nodes": [[["activation_37", 0, 0, {}], ["BatchNorm1_1_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_38", "inbound_nodes": [[["add_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_4_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_4_0_1", "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_4_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_4_0_1", "inbound_nodes": [[["Conv2D_1_4_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_4_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_4_0_1", "inbound_nodes": [[["BatchNorm1_1_4_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_4_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_4_0_2", "inbound_nodes": [[["Act1_1_4_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_4_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_4_0_2", "inbound_nodes": [[["Conv2D_1_4_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "name": "add_39", "inbound_nodes": [[["activation_38", 0, 0, {}], ["BatchNorm1_1_4_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_39", "inbound_nodes": [[["add_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_5_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_5_0_1", "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_5_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_5_0_1", "inbound_nodes": [[["Conv2D_1_5_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_5_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_5_0_1", "inbound_nodes": [[["BatchNorm1_1_5_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_5_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", 